{	"Page" : "About Us",
	"Page-Components" : [
		{
			"Section" : "Overview",
			"Section-Data" : "We know that computing is really about people. Some of the best make up our faculty and staff. The full-time faculty in our department are deeply committed to our mission of excellence in pedagogy and research. Their diversity and experience provide a rich environment for growth and learning. The department administration provides social, leadership and vision. Most of our adjunct faculty are computing professionals from the high-tech corridor surrounding Villanova. Their contributions in teaching, and their collaboration with our full-time faculty on various projects, bring additional insight from the commercial world into our classrooms. The Department of Computing Sciences is supported by an excellent staff who make the daily activities run smoothly. In addition to teaching, our faculty members are busy helping the department and university through their work on numerous committees and serving the academic community and computing science disciplines in many ways ."
		},
		{
			"Section" : "Mission Statement",
			"Section-Data" : "The Department of Computing Sciences at Villanova University seeks to provide outstanding education, to advance scholarship, and to engage in activities that benefit society as a whole, in accordance to the University mission. The Department aims to equip students with a solid foundation in computing theory, and to prepare them for lifelong independent learning and innovative thinking in a constantly changing discipline. Its faculty members strive to maintain professional currency, and to involve students and colleagues in their research investigations. These endeavors support the University mission to transmit, pursue, and discover knowledge in an atmosphere of collegiality in the university community. Supported by a liberal arts education, the Department seeks to develop the total person, sensitive to social and ethical concerns impacted by the computing discipline, and committed to addressing the needs of a diverse modern society. Mission Goals These goals serve to solidify our vision. We will Continue to offer an accredited BSCS program, which successfully prepares its graduates for careers in industry, graduate education, and life-long learning. Maintain rigor and high standards in the MSCS program, seeking to meet the needs of both part-time and full-time students. Advance our current program, create new programs, and promote interactions with other departments and programs to reflect the changing nature of computing. Introduce non major students to the fundamental ideas of computer science and its social relevance. Maintain pedagogical excellence in teaching and advising. Ensure that all faculty members remain current in our rapidly changing discipline. Pursue theoretical and applied research to enhance the knowledge of computing, and involve undergraduate and graduate students in our research effort. Support the Department, the College, the University, the profession, and the local community through leadership and participation in committees, conferences, and organizations. Pursue inter-disciplinary projects in research and teaching. Strive to expand and diversify our enrollments."
		},	
		{
			"Section" : "Enrollment Data",
			"Section-Data" : "Some data"
		},
		{
			"Section" : "Faculty",
			"Section-Data" : "We know that computing is really about people. Some of the best make up our faculty and staff. The full-time faculty in our department are deeply committed to our mission of excellence in pedagogy and research. Their diversity and experience provide a rich environment for growth and learning. The department administration provides social, leadership and vision. Most of our adjunct faculty are computing professionals from the high-tech corridor surrounding Villanova. Their contributions in teaching, and their collaboration with our full-time faculty on various projects, bring additional insight from the commercial world into our classrooms. The Department of Computing Sciences is supported by an excellent staff who make the daily activities run smoothly. In addition to teaching, our faculty members are busy helping the department and university through their work on numerous committees and serving the academic community and computing science disciplines in many ways ."
		}
	]
}